app/views/creatures/show.html.erb

    <p>
      <% @creature.tags.each do |tag|%>
---
SELECT "tags".* FROM "tags" INNER JOIN "creatures_tags" ON "tags"."id" = "creatures_tags"."tag_id" WHERE "creatures_tags"."creature_id" = ?  [["creature_id", 3]]