app/controllers/tags_controller.rb

  def create
    @tag = Tag.all
    @tag = Tag.create(tag_params)
---
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-15 18:53:13.595941"], ["name", ""], ["updated_at", "2015-01-15 18:53:13.595941"]]

  def destroy
    @tag = Tag.find(params[:id])
    # @tag.destroy

    if (@tag.creatures.length == 0)
      @tag.destroy
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
SELECT "creatures".* FROM "creatures" INNER JOIN "creatures_tags" ON "creatures"."id" = "creatures_tags"."creature_id" WHERE "creatures_tags"."tag_id" = ?  [["tag_id", 5]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]